{
  "backend/main.mo": "Primary canister logic defining company constants, user profiles, products, contact submissions, and admin‑gated CRUD APIs including storage and authorization mixins.",
  "backend/migration.mo": "Migration module converting old canister state to the new format by adding a pdf_document field initialized to null.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs for audit tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including pages, components, and hooks.",
  "frontend/index.css": "Tailwind base styles defining light and dark theme color variables and global layout rules.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Main React application managing routing, theme, admin detection, and rendering top-level pages with header and footer.",
  "frontend/src/components/admin/BusinessCardUpload.tsx": "UI component to preview current business card image and upload a new one, supporting image preview and cancel/reset actions.",
  "frontend/src/components/admin/PdfUpload.tsx": "UI for viewing the current uploaded PDF and uploading a new PDF file with basic validation and status handling.",
  "frontend/src/components/admin/ProductFormDialog.tsx": "Dialog form for creating or editing products, handling text fields, image upload, and submission to backend mutations.",
  "frontend/src/components/admin/ProductManagement.tsx": "Displays all products with options to add, edit, or delete, integrating the ProductFormDialog and confirmation dialogs.",
  "frontend/src/components/admin/SubmissionsView.tsx": "Fetches and displays contact form submissions with metadata like timestamp, email, and message content.",
  "frontend/src/components/Footer.tsx": "Footer showing company info, quick links, social icons, and attribution.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation links and conditional admin tab without login controls.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file with no implementation content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor based on identity, reinitializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status flags. Wraps AuthClient creation with custom options and exposes a useInternetIdentity hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as company info, images, PDFs, products, and contact form submissions. Integrates with an actor instance and shows toast notifications on mutations.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and defines light/dark theme color variables with gold accents. Adds global styles including scrollbar customization.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider. Mounts the App component and loads global styles.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin dashboard with authentication, admin checks, product management, submissions, and uploads. Handles login/logout flows using Internet Identity.",
  "frontend/src/pages/ContactPage.tsx": "Displays company contact details and a contact form that submits data via a React Query mutation. Handles form state and resets on success.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content, company info, business card image, and feature sections. Provides navigation buttons to products and contact pages.",
  "frontend/src/pages/ProductsPage.tsx": "A product listing page that fetches all products, supports search filtering, shows loading skeletons, and displays product cards with images, pricing, and specifications.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning sensitive values from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, container settings, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Metadata describing the project's structure, features, and versions, including authentication, admin token handling, RBAC, and catalog management capabilities."
}